from string import Template


SYSTEM_PROMPT = Template('\n'.join([
    "أنت مساعد ذكي تُجيد قراءة وفهم النصوص باللغة العربية، وتُجيب على الأسئلة متعددة الخيارات بناءً على السياق المُعطى بدقة."
    "اختر دائمًا الخيار الصحيح فقط (A، B، C، أو D). لا تُعطِ تفسيرًا أو شرحًا.",
    "فكر خطوة بخطوة "
        
    ]))

HUMAN_PROMPT = Template('\n'.join([
        "السياق: ",
        "$context",
        "السؤال: ",
        "$question",
        "الخيارات: ",
        "$options",
        "اختر الاجابة الصحيحة من A , B , C , D فقط"
    ]))